require('dotenv').config();

const config = {
  "walletAddressAndPrivateKeyMappings": process.env.ADDRESS_AND_PRIVATE_KEY_MAPPINGS.split("/").map(accountInfo => JSON.parse(accountInfo)), // 這是引入私鑰的，如果你的 .env 寫錯可能會拿不到值
  "defikingdoms": {
    "quest": {
      "fishing": {
        "heroes": [ // 這裡面只會寫你自己擁有的 hero id
          "1000000001285", "264769"       , "2000000011640", "1000000182798", "2000000101848",
          "1000000142917", "2000000069774", "2000000121907", "2000000210448", "1000000335951",
          "64707"        , "2000000109587", "2000000231597", "2000000228077", "2000000147732",
          "1000000001412", "2000000107608", "2000000232129", "1000000327679", "1000000327093",
          "285499"       , "2000000128582", "1000000307640", "2000000234280", "2000000234741",
          "1000000091200", "1000000158572", "1000000272576", "1000000349173", "1000000349483",
          "2000000008084", "1000000131263", "2000000034300", "1000000269560", "2000000178093",
          "240170"       , "2000000127251", "1000000108085", "1000000333313", "1000000337704",
          "245862"       , "1000000042496", "1000000131387", "1000000137700", "1000000330467",
          "1000000128529", "2000000117780", "2000000136068", "1000000243301", "2000000229117",
          "2000000057981", "2000000138375", "2000000139194", "2000000170476", "1000000335792",
          "256447"       , "2000000129307", "1000000271623", "1000000327538", "2000000235706",
          "2000000012839", "2000000118505", "2000000081945", "2000000180985", "2000000201681",
          "1000000071650", "2000000044062", "1000000194750", "1000000275095", "2000000237061",
          "2000000131297", "2000000138080", "2000000179934", "1000000348612", "2000000096061",
          "1000000138818", "2000000017162", "1000000280831", "1000000351901", "1000000338112",
          "2000000004564", "1000000109254", "2000000032113", "2000000150036", "2000000211966",
          "2000000030186", "1000000285157", "1000000322284", "2000000239737", "1000000353683",
          "1000000118325", "1000000248508", "2000000199236", "1000000295916", "2000000234515",
          "2000000030693", "1000000143816", "2000000047245", "2000000122650", "2000000239144",
          "2000000023906", "1000000260891",
          "2000000063437", "1000000265145", "1000000265146", "2000000177512",
          "2000000022290", "1000000160090", "2000000070612", "2000000157224", "2000000224692",
          "278830"       , "2000000025536", "1000000033227", "2000000157223",
          "2000000121034", "1000000268250", "2000000193316", "2000000192114",
          "1000000256449", "1000000323526", "2000000220949", "2000000177171",
          "2000000016561", "1000000162165", "2000000219506", "1000000338297",
          "1000000047111", "1000000268330", "1000000336936",
          "1000000149899", "1000000271740", "2000000111356", "2000000207406", "2000000230623",
          "1000000159952", "2000000171966", "1000000341145",
          "2000000011428", "1000000140072", "2000000135551", "2000000187768",
          "1000000279571", "1000000337255", "1000000336703", "1000000325140",
          "1000000188382", "1000000283395", "2000000188767", "1000000338329", "1000000342340",
          "1000000071159", "1000000289703", "1000000337462",
          "1000000140288", "1000000288502", "1000000283982",
          "1000000170708", "2000000041284", "1000000305585",
          "2000000041648", "2000000049786", "2000000223069",
          "1000000188854", "2000000043403", "2000000086175",
          "2000000092779",
        ],
        "minStamina": 25, // 執行任務的最低體力值
        "contractAddress": "0x407ab39B3675f29A719476af6eb3B9E5d93969E6"  //  合約的地址，你不會更改這個值
      },
      "foraging": {
        "heroes": [ // 這裡面只會寫你自己擁有的 hero id
          "2000000069590", "2000000118180", "2000000224868", "2000000220640",
          "1000000042990", "1000000130174", "1000000138303", "1000000140771", "1000000340030",
          "1000000143487", "2000000166051", "1000000289179", "1000000324685", "2000000231160",
          "259900"       , "2000000169665", "2000000195961", "2000000231596", "1000000327677",
          "1000000141416", "2000000112866", "1000000297494", "1000000293385",
          "1000000034323", "1000000160911", "2000000119137", "2000000213495", "1000000343143",
          "2000000030989", "2000000125436", "2000000175296", "2000000180600", "1000000329434",
          "2000000010501", "2000000120405", "2000000130096", "2000000137734", "2000000226998",
          "2000000134493", "2000000189291", "1000000175952", "2000000203797", "1000000331240",
          "238302"       , "1000000209017", "2000000139176", "1000000151731", "2000000220223",
          "1000000240694", "1000000338328", "1000000337713", "2000000203165", "1000000343512",
          "2000000003713", "2000000128132", "1000000243715", "2000000230271",
          "2000000018179", "2000000034356", "2000000038537", "1000000223360", "1000000326383",
          "246258"       , "225740"       , "2000000043049", "1000000232763", "2000000230465",
          "88372"        , "47809"        , "2000000032349", "2000000012052", "2000000219619",
          "1000000117135", "2000000083900", "1000000258234", "2000000170550", "1000000324669",
          "141989"       , "2000000171163", "2000000131178", "1000000331225", "2000000230617",
          "2000000057125", "2000000131604", "2000000181905", "2000000172059", "2000000178727",
          "284247"       , "1000000037557", "1000000114649", "1000000029320", "2000000181298",
          "1000000239353", "2000000136705", "2000000174072", "2000000230760", "1000000327089",
          "2000000101383", "2000000191803", "2000000207599", "1000000348070", "1000000348073",
          "1000000122811", "1000000334844", "2000000223575", "1000000340162", "2000000230854",
          "1000000150915", "1000000162823", "2000000035017", "1000000342286", "2000000231673",
          "2000000005161", "2000000004996", "1000000222253", "2000000231454", "1000000347567",
          "290898"       , "2000000073182", "2000000226058", "2000000236321", "1000000349265",
          "1000000085578", "2000000043171", "171562"       , "1000000238436", "1000000349482",
          "1000000131490", "2000000052739", "1000000349487", "1000000349488",
          "2000000010762", "1000000349491", "2000000233734", "2000000239605", "1000000350453",
          "203192"       , "1000000353228", "2000000239625", "274141"       , "2000000246428",
          "2000000042438",
          "1000000130504", "1000000169754",
          "103823"       , "1000000064538", "1000000192365",
          "292136"       ,
          "1000000065836", "1000000224094"
        ],
        "minStamina": 25, // 執行任務的最低體力值
        "contractAddress": "0xAd51199B453075C73FA106aFcAAD59f705EF7872" //  合約的地址，你不會更改這個值
      },
      "goldMining": {
        "singleBatchAmount": 6, // 單次送出的英雄數量
        "heroes": [ // 這裡面只會寫你自己擁有的 hero id
          "1000000089287", "2000000013000", "2000000035944", "2000000126061", "2000000067895", "1000000226043",
          "1000000022549", "1000000254330", "1000000242909", "2000000161338", "1000000138253", "1000000323764",
          "1000000072500", "2000000063830", "180095"       , "1000000254941", "1000000346672"
        ],
        "minStamina": 20, // 執行任務的最低體力值
        "contractAddress": "0x75912145f5cFEfb980616FA47B2f103210FaAb94" // 合約的地址，你不會更改這個值
      },
      "crystalMining": {
        "singleBatchAmount": 1, // 單次送出的英雄數量
        "heroes": [ // 這裡面只會寫你自己擁有的 hero id
          "235300"       , "1000000278718"
        ],
        "minStamina": 15, // 執行任務的最低體力值
        "contractAddress": "0x98b3C85ac3cC3EF36Ff25A9229857AbACE3e7410" // 合約的地址，你不會更改這個值
      },
      "gardening": {
        "pairAddressMappings": [
          {
            "tokenPair": "CRYSTAL-AVAX", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 1,
            "pairAddress": "0x8eDA0ceA7a90E794B33708Cc0768727A1A612f3d", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "2000000177339", "2000000183901", "2000000184094"
            ],
          },                 {
            "tokenPair": "CRYSTAL-wJEWEL", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 2,
            "pairAddress": "0xC4839Fb9A5466878168EaE3fD58c647B71475b61", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "210943", "1000000127319", "208971", "1000000146877", "1000000179494", "1000000295694"
            ],
          },                 {
            "tokenPair": "CRYSTAL-USDC", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 3,
            "pairAddress": "0x6FEF23498877bC4c3940ebE121dd7D138BdA4e11", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
             "1000000090424", "2000000139786", "2000000145109", "1000000316160", "1000000324697", "2000000216674"
            ],
          },                 {
            "tokenPair": "ETH-USDC", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 4,
            "pairAddress": "0xdeF7cBeE7d0B62037616ee26BCAc1C8364f53476", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "1000000043531", "1000000120304", "1000000206400", "2000000124010", "1000000300548", "2000000182765"
            ],
          },                 {
            "tokenPair": "wJEWEL-USDC", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 5,
            "pairAddress": "0xaac3933Faa3B668304C9276d10CA88853463BD42", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "277280", "280166", "1000000273656", "1000000312899", "1000000336218", "2000000230209"
            ],
          },                 {
            "tokenPair": "CRYSTAL-ETH", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 6,
            "pairAddress": "0x810e1fF51fDd58c474c66A31013713D1A17BF458", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "262381", "269798", "274333", "1000000046841", "1000000250776", "2000000182237"
            ],
          },                 {
            "tokenPair": "CRYSTAL-BTC.b", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 7,
            "pairAddress": "0x706916dbC3b66d89632708CC193080ea05E0534A", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "246617", "2000000001746", "1000000130649", "1000000104639", "1000000044371", "2000000130072"
            ],
          },                 {
            "tokenPair": "CRYSTAL-KLAY", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 8,
            "pairAddress": "0x1fCc67a01525fd715A67bCcbF73665Fb3dBE76c7", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "1000000085490", "2000000027484", "1000000123064", "2000000233708"
            ],
          },                 {
            "tokenPair": "JEWEL-KLAY", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 9,
            "pairAddress": "0x2A70aA48f9dBF859239ae5E7f98fe95aE27A6CD4", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "1000000139045", "1000000182919", "2000000166717", "1000000080999", "1000000349860"
            ],
          },                 {
            "tokenPair": "JEWEL-AVAX", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 10,
            "pairAddress": "0xA0d17554F09047d65E0ae0e76CD8923A9525183c", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "2000000004106", "1000000139085", "1000000139091", "2000000135440"
            ],
          },                 {
            "tokenPair": "JEWEL-BTC.b", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 11,
            "pairAddress": "0x3391B9384AC66C7Aa3BF4A75A4f441942B1dCf30", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "1000000009289", "2000000032177", "244904", "2000000161598", "1000000263698", "2000000162296"
            ],
          },                 {
            "tokenPair": "JEWEL-ETH", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 12,
            "pairAddress": "0xbaEc39Dd81b964B57bc5fa5f5421Cd82185409E6", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "2000000134616", "1000000218267", "2000000107313", "1000000112309", "2000000214722", "1000000325566"
            ],
          },                 {
            "tokenPair": "BTC.b-USDC", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 13,
            "pairAddress": "0x045838dBfb8026520E872c8298F4Ed542B81Eaca", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "1000000134570", "1000000345327", "2000000222469"
            ],
          }
        ],
        "minStamina": 15, // 執行任務的最低體力值
      },
      "statQuest": {
        "minStamina": 25,
        "quests": [
          {
            "name": "StatQuest_Str", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "1000000085774", "2000000006116", "2000000144165", "1000000325551",
              "2000000131371", "1000000257472", "2000000150183", "2000000200590", "1000000292578",
              "1000000087038", "1000000155479", "2000000148071", "1000000280039", "1000000178110",
              "256082"       , "2000000103915", "1000000269835", "1000000284064", "2000000194572",
              "1000000038180", "2000000044937", "1000000253341", "2000000148772", "1000000346700",
              "2000000033642", "2000000022224", "2000000151950", "1000000357355",
              "2000000053144", "1000000260892", "2000000156100", "2000000154828",
              "2000000059629", "2000000061077", "1000000195782",
              "1000000189752", "2000000092945", "1000000243677",
              "1000000188941", "1000000272593", "127054"       ,
              "147643"       , "1000000196331", "2000000074464", "1000000191049",
              "2000000090469", "1000000257220", "2000000113773",
              "2000000091165", "1000000127390", "2000000067720",
              "1000000221984", "1000000232348", "2000000068381", "2000000207130", "2000000207605",
              "2000000172138", "2000000192071", "2000000194252", "1000000292812",
              "1000000290596", "2000000199711", "2000000209859", "2000000213505", "1000000311894"
            ],
            "questTypeId": 0,
          },
          {
            "name": "StatQuest_Dex", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "2000000134419",
              "1000000030073", "1000000019469", "1000000222205", "1000000240490",
              "1000000073168", "2000000033061", "2000000066143", "2000000108557",
              "1000000088633", "2000000044511", "1000000266607",
              "2000000018230", "1000000171542", "1000000242220", "1000000262304",
              "1000000164335", "2000000049215", "2000000054006", "2000000177100",
              "1000000184845", "1000000196916"
            ],
            "questTypeId": 7,
          },
          {
            "name": "StatQuest_Agi", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "1000000030876", "1000000038061", "1000000171444", "1000000292750", "1000000343774",
              "2000000004273", "2000000006821", "1000000109415", "2000000005262",
              "2000000119665", "1000000215864",
              "1000000144538", "1000000250750",
              "2000000137179", "2000000149966", "1000000290782",
              "171977"       , "2000000088527", "1000000265377", "2000000174030", "1000000325572",
              "2000000179735", "1000000282082"
            ],
            "questTypeId": 4,
          },
          {
            "name": "StatQuest_Vit", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "1000000059047", "2000000018790", "2000000109825", "2000000142571", "1000000294994",
              "2000000028749", "1000000160286", "2000000065275", "1000000309842",
              "2000000037802", "1000000194418", "2000000137064", "1000000325568", "2000000218383",
              "2000000073705",
              "2000000086742", "1000000222072", "1000000251270",
              "1000000219338", "2000000149412", "2000000021352",
            ],
            "questTypeId": 5,
          },
          {
            "name": "StatQuest_End", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "2000000084150", "2000000170320", "1000000277715",
              "2000000044503", "2000000088107", "1000000222082",
              "1000000224106", "2000000132747"
            ],
            "questTypeId": 6,
          },
          {
            "name": "StatQuest_Int", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "2000000070913", "2000000131553", "1000000263439", "1000000306045",
              "1000000091089", "2000000071731", "1000000325576",
              "2000000003586", "2000000129786",
              "1000000222034", "2000000197332",
              "1000000222035",
            ],
            "questTypeId": 1,
          },
          {
            "name": "StatQuest_Wis", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "294901"       , "1000000220517", "2000000099589", "2000000163947", "1000000327054",
              "2000000215309",
              "2000000111691", "2000000096913", "2000000191234",
              "2000000096519", "1000000214520", "2000000165702"
            ],
            "questTypeId": 2,
          },
          {
            "name": "StatQuest_Luk", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "2000000119689", "2000000188815",
              "2000000190616",
              "2000000069199",
              "2000000072425", "2000000081252", "1000000296401"
            ],
            "questTypeId": 3,
          }
        ]
      }
    },
    "useStaminaVialHeroIds": [ // 把你想要自動使用耐力藥水的英雄 ID 寫在這裡，例如 "1000000064538"
      
    ],
    "heroForSale": [ // 你想要販售的英雄與價格，price 請填整數，否則會出錯
      // 格式範例 { "id": "1234", "price": 25000 }
      { "id": "301253", "price": 139 },
      { "id": "1000000063769", "price": 125 },
      { "id": "1000000194418", "price": 135 },
      { "id": "2000000072425", "price": 149 },
      { "id": "1000000221984", "price": 89 },
      { "id": "1000000222035", "price": 99 },
      { "id": "1000000222072", "price": 95 },
      { "id": "1000000222205", "price": 85 },
      { "id": "2000000069199", "price": 125 },
      { "id": "2000000081252", "price": 105 },
      { "id": "2000000003713", "price": 275 },
      { "id": "1000000043531", "price": 169 },
      { "id": "1000000072500", "price": 459 },
      { "id": "1000000194750", "price": 175 },
      { "id": "2000000035017", "price": 185 },
      { "id": "2000000043171", "price": 165 },
      { "id": "2000000043403", "price": 199 },
      { "id": "2000000088107", "price": 135 },
      { "id": "2000000091165", "price": 239 },
      { "id": "244904", "price": 399 },
      { "id": "1000000130504", "price": 299 },
      { "id": "1000000022549", "price": 319 },
      { "id": "1000000196331", "price": 155 },
      { "id": "1000000254941", "price": 125 },
      { "id": "2000000070913", "price": 125 },
      { "id": "2000000108557", "price": 129 },
      { "id": "2000000144165", "price": 1999 },
      { "id": "1000000214520", "price": 169 },
      { "id": "1000000242220", "price": 155 },
      { "id": "1000000257472", "price": 145 },
      { "id": "1000000260892", "price": 165 },
      { "id": "2000000004273", "price": 229 },
      { "id": "2000000049215", "price": 145 },
      { "id": "2000000103915", "price": 149 },
      { "id": "2000000151950", "price": 135 },
      { "id": "1000000123064", "price": 279 },
      { "id": "1000000127390", "price": 175 },
      { "id": "1000000130649", "price": 289 },
      { "id": "1000000131387", "price": 179 },
      { "id": "1000000139091", "price": 239 },
      { "id": "2000000073705", "price": 185 },
      { "id": "2000000126061", "price": 139 },
      { "id": "147643", "price": 299 },
      { "id": "294901", "price": 329 },
      { "id": "1000000009289", "price": 449 },
      { "id": "1000000038180", "price": 449 },
      { "id": "1000000042990", "price": 299 },
      { "id": "1000000046841", "price": 499 },
      { "id": "1000000109415", "price": 369 },
      { "id": "1000000112309", "price": 429 },
      { "id": "1000000120304", "price": 399 },
      { "id": "1000000138253", "price": 599 },
      { "id": "1000000139045", "price": 369 },
      { "id": "1000000149899", "price": 369 },
      { "id": "1000000195782", "price": 439 },
      { "id": "1000000206400", "price": 299 },
      { "id": "1000000220517", "price": 159 },
      { "id": "1000000222034", "price": 759 },
      { "id": "1000000251270", "price": 199 },
      { "id": "1000000262304", "price": 135 },
      { "id": "2000000003586", "price": 499 },
      { "id": "2000000011640", "price": 219 },
      { "id": "2000000012839", "price": 399 },
      { "id": "2000000049786", "price": 259 },
      { "id": "2000000053144", "price": 299 },
      { "id": "2000000130072", "price": 449 },
      { "id": "2000000131553", "price": 249 },
      { "id": "2000000149966", "price": 169 },
      { "id": "2000000190616", "price": 125 },
      { "id": "2000000210448", "price": 649 },
      { "id": "127054", "price": 1999 },
      { "id": "171977", "price": 175 },
      { "id": "180095", "price": 449 },
      { "id": "259900", "price": 449 },
      { "id": "1000000034323", "price": 449 },
      { "id": "1000000091089", "price": 449 },
      { "id": "1000000114649", "price": 449 },
      { "id": "1000000122811", "price": 399 },
      { "id": "1000000131263", "price": 499 },
      { "id": "1000000140771", "price": 429 },
      { "id": "1000000169754", "price": 329 },
      { "id": "1000000192365", "price": 429 },
      { "id": "1000000222082", "price": 399 },
      { "id": "1000000224106", "price": 599 },
      { "id": "1000000242909", "price": 159 },
      { "id": "1000000263439", "price": 125 },
      { "id": "1000000265145", "price": 159 },
      { "id": "1000000266607", "price": 139 },
      { "id": "1000000271740", "price": 155 },
      { "id": "1000000296401", "price": 155 },
      { "id": "1000000297494", "price": 159 },
      { "id": "2000000022290", "price": 399 },
      { "id": "2000000032349", "price": 239 },
      { "id": "2000000092945", "price": 329 },
      { "id": "2000000119665", "price": 125 },
      { "id": "2000000119689", "price": 125 },
      { "id": "2000000142571", "price": 559 },
      { "id": "2000000148772", "price": 139 },
      { "id": "2000000161338", "price": 115 },
      { "id": "2000000163947", "price": 115 },
      { "id": "2000000174030", "price": 259 },
      { "id": "2000000188815", "price": 115 },
      { "id": "2000000194252", "price": 129 }
    ],
    "useRpcIndex": 0, // 表示你想要使用的 rpc ，0 是 下方 rpcs 的第一個，1 是第二個以次類推，網路卡頓的時候可以嘗試換個 rpc
    "rpcs": [
      "https://subnets.avax.network/defi-kingdoms/dfk-chain/rpc",
      "https://avax-dfk.gateway.pokt.network/v1/lb/6244818c00b9f0003ad1b619/ext/bc/q2aTwKuyzgs8pynF7UXBZCU7DejbZbZ6EUyHr3JQzYgwNPUPi/rpc"
    ],
    "shvasRune": "0x75E8D8676d774C9429FbB148b30E304b5542aC3d", // 合約的地址，你不會更改這個值
    "mokshaRune": "0xCd2192521BD8e33559b0CA24f3260fE6A26C28e4", // 合約的地址，你不會更改這個值
    "staminaVial": "0x242078edFDca25ef2A497C8D9f256Fd641472E5F", // 合約的地址，你不會更改這個值
    "availableForSaleTokens": [ // 可自由更改下方 "sale" 裡面的值成 true 或是 false，true 表示要賣，false 的則不會賣掉
      {
        "name": "Ambertaffy",
        "contractAddress": "0xB78d5580d6D897DE60E1A942A5C1dc07Bc716943",
        "sale": true
      },
      {
        "name": "Bluestem",
        "contractAddress": "0x0776b936344DE7bd58A4738306a6c76835ce5D3F",
        "sale": false
      },
      {
        "name": "Darkweed",
        "contractAddress": "0x848Ac8ddC199221Be3dD4e4124c462B806B6C4Fd",
        "sale": true
      },
      {
        "name": "Ironscale",
        "contractAddress": "0x04B43D632F34ba4D4D72B0Dc2DC4B30402e5Cf88",
        "sale": true
      },
      {
        "name": "Lanterneye",
        "contractAddress": "0xc2Ff93228441Ff4DD904c60Ecbc1CfA2886C76eB",
        "sale": true
      },
      {
        "name": "Milkweed",
        "contractAddress": "0xA2cef1763e59198025259d76Ce8F9E60d27B17B5",
        "sale": false
      },
      {
        "name": "Rockroot",
        "contractAddress": "0x60170664b52c035Fcb32CF5c9694b22b47882e5F",
        "sale": true
      },
      {
        "name": "Sailfish",
        "contractAddress": "0x7f46E45f6e0361e7B9304f338404DA85CB94E33D",
        "sale": false
      },
      {
        "name": "Shimmerskin",
        "contractAddress": "0xd44ee492889C078934662cfeEc790883DCe245f3",
        "sale": false
      },
      {
        "name": "Skunk Shade",
        "contractAddress": "0xc6030Afa09EDec1fd8e63a1dE10fC00E0146DaF3",
        "sale": true
      },
      {
        "name": "Spiderfruit",
        "contractAddress": "0x3E022D84D397F18743a90155934aBAC421D5FA4C",
        "sale": true
      },
      {
        "name": "Swift-Thistle",
        "contractAddress": "0x97b25DE9F61BBBA2aD51F1b706D4D7C04257f33A",
        "sale": false
      },
      {
        "name": "Three-Eyed Eel",
        "contractAddress": "0x6513757978E89e822772c16B60AE033781A29A4F",
        "sale": true
      },
      {
        "name": "Bloater",
        "contractAddress": "0x268CC8248FFB72Cd5F3e73A9a20Fa2FF40EfbA61",
        "sale": true
      },
      {
        "name": "Frost Bloater",
        "contractAddress": "0x3bcb9A3DaB194C6D8D44B424AF383E7Db51C82BD",
        "sale": true
      },
      {
        "name": "Frost Drum",
        "contractAddress": "0xe7a1B580942148451E47b92e95aEB8d31B0acA37",
        "sale": true
      },
      {
        "name": "Goldvein",
        "contractAddress": "0x0096ffda7A8f8E00e9F8Bbd1cF082c14FA9d642e",
        "sale": true
      },
      {
        "name": "King Pincer",
        "contractAddress": "0x60A3810a3963f23Fa70591435bbe93BF8786E202",
        "sale": true
      },
      {
        "name": "Knaproot",
        "contractAddress": "0xBcdD90034eB73e7Aec2598ea9082d381a285f63b",
        "sale": true
      },
      {
        "name": "Ragweed",
        "contractAddress": "0x137995beEEec688296B0118131C1052546475fF3",
        "sale": true
      },
      {
        "name": "Redgill",
        "contractAddress": "0x68eE50dD7F1573423EE0Ed9c66Fc1A696f937e81",
        "sale": true
      },
      {
        "name": "Redleaf",
        "contractAddress": "0x473A41e71618dD0709Ba56518256793371427d79",
        "sale": true
      },
      {
        "name": "Shaggy Caps",
        "contractAddress": "0x80A42Dc2909C0873294c5E359e8DF49cf21c74E4",
        "sale": true
      },
      {
        "name": "Silverfin",
        "contractAddress": "0xA7CFd21223151700FB82684Cd9c693596267375D",
        "sale": true
      },
      {
        "name": "Speckle Tail",
        "contractAddress": "0xE7CB27ad646C49dC1671Cb9207176D864922C431",
        "sale": true
      },
    ],
    "duelSetting": {
      "isActive": true, // 表示是否要執行 DFK 自動 duel，true 的情形就會自動執行
      "autoDuelerWalletIndex": 0, // 設定你用於自動 duel 的 account 是哪一個，如果是 0 就是你寫在 env 的第一個帳號， 1 就是第二個以此類推
      "type": "solo", // duel 的類型，solo, squad, war 其中一種
      "fee": "low", // 花費幣的數量 low, medium, high 其中一種
      "notForDuelHeroes": [ 
        /*
          會自動抓取最適合出戰的英雄
          計算邏輯為: 英雄總數值 - ((等級 - 1) * 10) + 以選取的英雄有相同背景的數量 * 2 + 以選取的英雄有相同的最高屬性 * 3 + 獎勵主屬性 20 點 + 獎勵副屬性 10 點
          如果你有完全不想在 duel 出戰的英雄請把 id 寫在這裡
        */
      ]
    },
    "raffleSetting": { // 會在每個獎池放入 enterAmount 輸入的值，如果抽獎券不夠會直接跳過
      "isActive": true, // 表示是否要執行自動抽獎，true 的情形就會自動執行
      "enterAmount": 30, // 每個獎池放入的券數量
    },
    "maxGasPrice": 20000000000, // 表示你可以接受的最大 baseFee 是多少，當 baseFee 超過這個值時任務腳本就會暫停，6000000000 表示 6 Gwei，請依你的需要調整
    "overBaseGasFeeWei": 550000000, // 表示你願意出高於 baseFee 多少的 gas，理論上這個數字越高你的交易速度就會越快， 110000000 表示 0.11 Gwei，請依你的需要調整
    "listStamina": 24, // 表示當你的英雄體力低於多少時要進行掛售，體力值高於這個設定的英雄如果是下架狀態會等做完任務才會再次上架
  },
  "klay": {
    "quest": {
      "fishing": {
        "heroes": [ // 這裡面只會寫你自己擁有的 hero id

        ],
        "minStamina": 25, // 執行任務的最低體力值
        "contractAddress": "0x0E7a8b035eF2FA0183a2680458818256424Bd60B"  //  合約的地址，你不會更改這個值
      },
      "foraging": {
        "heroes": [ // 這裡面只會寫你自己擁有的 hero id

        ],
        "minStamina": 25, // 執行任務的最低體力值
        "contractAddress": "0x54DaD24dDc2cC6E7616438816DE0EeFCad79B625" //  合約的地址，你不會更改這個值
      },
      "goldMining": {
        "singleBatchAmount": 6, // 單次送出的英雄數量
        "heroes": [ // 這裡面只會寫你自己擁有的 hero id

        ],
        "minStamina": 20, // 執行任務的最低體力值
        "contractAddress": "0x46F036B26870188aD69877621815238D2b81bef1" // 合約的地址，你不會更改這個值
      },
      "jadeMining": {
        "singleBatchAmount": 6, // 單次送出的英雄數量
        "heroes": [ // 這裡面只會寫你自己擁有的 hero id
          "1000000047704", "1000000073976", "1000000072758", "1000000062264", "1000000031392", "1000000052246",
          "1000000043706", "2000000021079", "1000000075777", "2000000115219",
          "1000000001443", "2000000013225", "1000000020702", "1000000033947", "1000000052725"
        ],
        "minStamina": 15, // 執行任務的最低體力值
        "contractAddress": "0x20B274262FA6da57B5Ff90498EC373c0266eF901" // 合約的地址，你不會更改這個值
      },
      "gardening": {
        "pairAddressMappings": [
          {
            "tokenPair": "JADE-JEWEL", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 0,
            "pairAddress": "0x3837612f3A14C92Da8E0186AB398A753fe169dc1", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
          },                 {
            "tokenPair": "JADE-wKLAY", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 1,
            "pairAddress": "0xc1C01a860B841F47f8191026D9Ca8eE2F1f37ab3", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
          },                 {
            "tokenPair": "JADE-AVAX", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 2,
            "pairAddress": "0x7643ADB5AaF129A424390CB055d6e23231fFd690", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
          },                 {
            "tokenPair": "JADE-oUSDT", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 3,
            "pairAddress": "0x177D9F3A92630CB8C46F169b1F99a12A7a326c45", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
          },                 {
            "tokenPair": "JADE-oBTC", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 4,
            "pairAddress": "0x05305c97e9A2FDC0F5Ea23824c1348DEeD9Aff04", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
          },                 {
            "tokenPair": "JADE-oETH", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 5,
            "pairAddress": "0xb911F5D6F9129365d1a415DD3CBa17F0240CFA70", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              "196194", "261081", "1000000038381", "1000000032435", "1000000087935"
            ],
          },                 {
            "tokenPair": "JEWEL-wKLAY", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 6,
            "pairAddress": "0x3198f51A1c8cFC5f1FeaD58feaa19E6dFc8e9737", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
          },                 {
            "tokenPair": "JEWEL-AVAX", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 7,
            "pairAddress": "0xDAd93871e42a11aD577E4DCa02c7C426800A47D5", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
          },                 {
            "tokenPair": "JEWEL-oUSDT", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 8,
            "pairAddress": "0x0831f733870e847263907F32B3367De2f47CeAf0", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
          },                 {
            "tokenPair": "JEWEL-oBTC", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 9,
            "pairAddress": "0x85106b1aF8B0337CB39a9aacDa87849B882a3170", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
          },                 {
            "tokenPair": "JEWEL-oETH", // 沒有邏輯用到這個字串，單純是方便你辨識當前任務用的
            "poolId": 10,
            "pairAddress": "0x7038F49cAA6e2f26677D237A2A40EC6354bA1eA5", // pair 的合約地址，你不會更改這個值
            "singleBatchAmount": 2, // 單次送出的英雄數量
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id

            ], 
          }
        ],
        "minStamina": 15, // 執行任務的最低體力值
      },
      "statQuest": {
        "minStamina": 25, // 執行任務的最低體力值
        "quests": [
          {
            "name": "StatQuest_Str", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id

            ],
            "questTypeId": 0,
          },
          {
            "name": "StatQuest_Dex", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id

            ],
            "questTypeId": 7,
          },
          {
            "name": "StatQuest_Agi", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id

            ],
            "questTypeId": 4,
          },
          {
            "name": "StatQuest_Vit", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id

            ],
            "questTypeId": 5,
          },
          {
            "name": "StatQuest_End", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
            "questTypeId": 6,
          },
          {
            "name": "StatQuest_Int", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id
              
            ],
            "questTypeId": 1,
          },
          {
            "name": "StatQuest_Wis", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id

            ],
            "questTypeId": 2,
          },
          {
            "name": "StatQuest_Luk", // 有地方會用到這個值，不要更改它
            "heroes": [ // 這裡面只會寫你自己擁有的 hero id

            ],
            "questTypeId": 3,
          }
        ]
      }
    },
    "useStaminaVialHeroIds": [ // 把你想要自動使用耐力藥水的英雄 ID 寫在這裡，例如 "1000000064538"
      
    ],
    "heroForSale": [ // 你想要販售的英雄與價格，price 請填整數，否則會出錯
      // 格式範例 { "id": "1234", "price": 25000 }
      { "id": "1000000073976", "price": 349 },
      { "id": "196194", "price": 259 },
      { "id": "1000000052246", "price": 289 },
      { "id": "2000000013225", "price": 199 },
      { "id": "261081", "price": 499 },
      { "id": "1000000047704", "price": 469 },
      { "id": "1000000072758", "price": 559 },
      { "id": "1000000032435", "price": 899 },
      { "id": "1000000038381", "price": 999 },
      { "id": "1000000062264", "price": 999 },
      { "id": "2000000021079", "price": 749 }
    ],
    "useRpcIndex": 0, // 表示你想要使用的 rpc ，0 是 下方 rpcs 的第一個，1 是第二個以次類推，網路卡頓的時候可以嘗試換個 rpc
    "rpcs": [
      "https://klaytn.rpc.defikingdoms.com",
      "https://klaytn-rpc.gateway.pokt.network"
    ],
    "shvasRune": "0x907a98319AEB249e387246637149f4B2e7D21dB7", // 合約的地址，你不會更改這個值
    "mokshaRune": "0xd0223143057Eb44065e789b202E03A5869a6006C", // 合約的地址，你不會更改這個值
    "staminaVial": "0x4546DBaAb48Bf1BF2ad7B56d04952d946Ab6e2a7", // 合約的地址，你不會更改這個值
    "availableForSaleTokens": [ // 可自由更改下方 "sale" 裡面的值成 true 或是 false，true 表示要賣，false 的則不會賣掉
      {
        "name": "Ambertaffy",
        "contractAddress": "0x75E8D8676d774C9429FbB148b30E304b5542aC3d",
        "sale": true
      },
      {
        "name": "Bluestem",
        "contractAddress": "0xDbd4fA2D2C62C6c60957a126970e412Ed6AC1bD6",
        "sale": false
      },
      {
        "name": "Darkweed",
        "contractAddress": "0xEDFBe9EEf42FfAf8909EC9Ce0d79850BA0C232FE",
        "sale": true
      },
      {
        "name": "Ironscale",
        "contractAddress": "0xBcdD90034eB73e7Aec2598ea9082d381a285f63b",
        "sale": true
      },
      {
        "name": "Lanterneye",
        "contractAddress": "0x80A42Dc2909C0873294c5E359e8DF49cf21c74E4",
        "sale": true
      },
      {
        "name": "Milkweed",
        "contractAddress": "0xE408814828f2b51649473c1a05B861495516B920",
        "sale": false
      },
      {
        "name": "Rockroot",
        "contractAddress": "0xf2D479DaEdE7F9e270a90615F8b1C52F3C487bC7",
        "sale": true
      },
      {
        "name": "Sailfish",
        "contractAddress": "0xc6030Afa09EDec1fd8e63a1dE10fC00E0146DaF3",
        "sale": false
      },
      {
        "name": "Shimmerskin",
        "contractAddress": "0xa61Bac689AD6867a605633520D70C49e1dCce853",
        "sale": false
      },
      {
        "name": "Skunk Shade",
        "contractAddress": "0x874FC0015ece1d77ba3D5668F16c46ba72913239",
        "sale": true
      },
      {
        "name": "Spiderfruit",
        "contractAddress": "0x08D93Db24B783F8eBb68D7604bF358F5027330A6",
        "sale": true
      },
      {
        "name": "Swift-Thistle",
        "contractAddress": "0xCd2192521BD8e33559b0CA24f3260fE6A26C28e4",
        "sale": false
      },
      {
        "name": "Three-Eyed Eel",
        "contractAddress": "0x7E1298EBF3a8B259561df6E797Ff8561756E50EA",
        "sale": true
      },
      {
        "name": "Bloater",
        "contractAddress": "0x72F860bF73ffa3FC42B97BbcF43Ae80280CFcdc3",
        "sale": true
      },
      {
        "name": "Frost Bloater",
        "contractAddress": "0x18cB286EeCE992f79f601E49acde1D1F5dE32a30",
        "sale": true
      },
      {
        "name": "Frost Drum",
        "contractAddress": "0xD69542aBE74413242e387Efb9e55BE6A4863ca10",
        "sale": true
      },
      {
        "name": "Goldvein",
        "contractAddress": "0xeaF833A0Ae97897f6F69a728C9c17916296cecCA",
        "sale": true
      },
      {
        "name": "King Pincer",
        "contractAddress": "0xB4A516bf36e44c0CE9E3E6769D3BA87341Cd9959",
        "sale": true
      },
      {
        "name": "Knaproot",
        "contractAddress": "0xFceFA4Abcb18a7053393526f75Ad33fac5F25dc9",
        "sale": true
      },
      {
        "name": "Ragweed",
        "contractAddress": "0x4cD7025BD6e1b77105b90928362e6715101d0b5a",
        "sale": true
      },
      {
        "name": "Redgill",
        "contractAddress": "0x8D2bC53106063A37bb3DDFCa8CfC1D262a9BDCeB",
        "sale": true
      },
      {
        "name": "Redleaf",
        "contractAddress": "0xadbF23Fe3B47857614940dF31B28179685aE9B0c",
        "sale": true
      },
      {
        "name": "Shaggy Caps",
        "contractAddress": "0xCe370D379f0CCf746B3426E3BD3923f3aDF0DC1a",
        "sale": true
      },
      {
        "name": "Silverfin",
        "contractAddress": "0x7E121418cC5080C96d967cf6A033B0E541935097",
        "sale": true
      },
      {
        "name": "Speckle Tail",
        "contractAddress": "0x48d9fC80A47cee2d52DE950898Bc6aBF54223F81",
        "sale": true
      },
    ],
    "duelSetting": {
      "isActive": false, // 表示是否要執行 KLAY 自動 duel，true 的情形就會自動執行
      "autoDuelerWalletIndex": 0, // 設定你用於自動 duel 的 account 是哪一個，如果是 0 就是你寫在 env 的第一個帳號， 1 就是第二個以此類推
      "type": "squad", // duel 的類型，solo, squad, war 其中一種
      "fee": "low", // 花費幣的數量 low, medium, high 其中一種
      "notForDuelHeroes": [ 
        /*
          會自動抓取最適合出戰的英雄
          計算邏輯為: 英雄總數值 - ((等級 - 1) * 10) + 以選取的英雄有相同背景的數量 * 2 + 以選取的英雄有相同的最高屬性 * 3 + 獎勵主屬性 20 點 + 獎勵副屬性 10 點
          如果你有完全不想在 duel 出戰的英雄請把 id 寫在這裡
        */
      ]
    },
    "raffleSetting": { // 會在每個獎池放入 enterAmount 輸入的值，如果抽獎券不夠會直接跳過
      "isActive": true, // 表示是否要執行自動抽獎，true 的情形就會自動執行
      "enterAmount": 30, // 每個獎池放入的券數量
    },
    "maxGasPrice": 30000000000, // 表示你可以接受的最大 baseFee 是多少，當 baseFee 超過這個值時任務腳本就會暫停，6000000000 表示 6 Gwei，請依你的需要調整
    "overBaseGasFeeWei": 300000000, // 表示你願意出高於 baseFee 多少的 gas，理論上這個數字越高你的交易速度就會越快， 110000000 表示 0.11 Gwei，請依你的需要調整
    "listStamina": 24, // 表示當你的英雄體力低於多少時要進行掛售，體力值高於這個設定的英雄如果是下架狀態會等做完任務才會再次上架
  },
  "autoBuyerSetting": {
    "autoBuyerFloorPrice": 15, // 所有你沒有寫的組合都是用這個價格當作最低價
    "KLAYnetworkBuyerEstimateAdjustment": 1.4, // KLAY 鏈的購買估價會再乘以這個數，如果覺得 KLAY 鏈估價太低或太高可以調整這個數字
    "DFKnetworkBuyerEstimateAdjustment": 1.1, // DFK 鏈的購買估價會再乘以這個數，如果覺得 DFK 鏈估價太低或太高可以調整這個數字
    "buyerEstimateAdjustment": 1, // 任何鏈的購買估價會再乘以這個數，如果覺得估價太低或太高可以調整這個數字
    "autoBuyerSwitch": true, // 自動購買的開關，設定為 false 時將不會自動購買，只會列出上架的英雄
    "saleWatcherWalletIndex": 0, // 設定你用於自動購買的 account 是哪一個，如果是 0 就是你寫在 env 的第一個帳號， 1 就是第二個以此類推
    "priceSetting": { 
      /*
        你可以自訂你想要的購買條件，
        格式為 "<稀有度><主職業階級><召喚數>/<召喚最大值>G<代數>"
        數字的部分不管幾都可以的話可以輸入 "?" 但是請謹慎使用
        寧可多寫幾條，避免買到你不想買的英雄
      */
      "CommonBasic10/10G1": 110,
      "CommonBasic9/10G1": 95,
      "CommonBasic8/10G1": 85,
      "CommonBasic7/10G1": 60,
      "CommonBasic6/10G1": 35,
      "CommonBasic9/9G2": 50,
      "CommonBasic8/?G2": 45,
      "CommonBasic7/?G2": 40,
      "CommonAdvanced5/5G1": 145,
      "CommonAdvanced4/5G1": 125,
      "CommonAdvanced3/5G1": 95,
      "CommonAdvanced5/5G2": 110,
      "CommonAdvanced4/?G2": 95,
      "CommonAdvanced3/?G2": 75,
      "CommonAdvanced5/5G3": 100,
      "CommonAdvanced4/?G3": 85,
      "CommonAdvanced3/?G3": 65,
      "CommonAdvanced5/5G4": 95,
      "CommonAdvanced4/?G4": 75,
      "CommonAdvanced3/?G4": 50,
      "CommonElite3/3G?": 550,
      "CommonElite2/?G?": 360,
      "CommonElite1/?G?": 220,
      "CommonElite?/?G?": 100,
      "CommonTranscendant1/1G?": 1500,
      "CommonTranscendant?/?G?": 1000,
      "UnCommonBasic10/10G1": 110,
      "UnCommonBasic9/10G1": 95,
      "UnCommonBasic8/10G1": 80,
      "UnCommonBasic7/10G1": 65,
      "UnCommonBasic6/10G1": 37,
      "UnCommonBasic9/9G2": 50,
      "UnCommonBasic8/?G2": 45,
      "UnCommonBasic7/?G2": 40,
      "UnCommonAdvanced5/5G1": 145,
      "UnCommonAdvanced4/5G1": 125,
      "UnCommonAdvanced3/5G1": 95,
      "UnCommonAdvanced5/5G2": 110,
      "UnCommonAdvanced4/?G2": 95,
      "UnCommonAdvanced3/?G2": 75,
      "UnCommonAdvanced5/5G3": 99,
      "UnCommonAdvanced4/?G3": 85,
      "UnCommonAdvanced3/?G3": 65,
      "UnCommonAdvanced5/5G4": 95,
      "UnCommonAdvanced4/?G4": 75,
      "UnCommonAdvanced3/?G4": 50,
      "UnCommonAdvanced?/?G?": 30,
      "UnCommonElite3/3G?": 600,
      "UnCommonElite2/?G?": 400,
      "UnCommonElite1/?G?": 240,
      "UnCommonElite?/?G?": 110,
      "UnCommonTranscendant1/1G?": 1650,
      "UnCommonTranscendant?/?G?": 1100,
      "RareBasic?/?G0": 25000,
      "RareBasic10/10G1": 125,
      "RareBasic9/10G1": 105,
      "RareBasic8/10G1": 95,
      "RareBasic7/10G1": 70,
      "RareBasic6/10G1": 45,
      "RareBasic9/9G2": 75,
      "RareBasic8/?G2": 68,
      "RareBasic7/?G2": 60,
      "RareAdvanced5/5G1": 180,
      "RareAdvanced4/5G1": 130,
      "RareAdvanced3/5G1": 100,
      "RareAdvanced2/5G1": 85,
      "RareAdvanced1/5G1": 65,
      "RareAdvanced5/5G2": 170,
      "RareAdvanced4/?G2": 120,
      "RareAdvanced3/?G2": 90,
      "RareAdvanced2/?G2": 75,
      "RareAdvanced1/?G2": 60,
      "RareAdvanced5/5G3": 150,
      "RareAdvanced4/?G3": 115,
      "RareAdvanced3/?G3": 85,
      "RareAdvanced2/?G3": 65,
      "RareAdvanced1/?G3": 60,
      "RareAdvanced5/5G4": 135,
      "RareAdvanced4/?G4": 110,
      "RareAdvanced3/?G4": 90,
      "RareAdvanced?/?G?": 70,
      "RareElite3/3G?": 1000,
      "RareElite2/?G?": 800,
      "RareElite1/?G?": 650,
      "RareElite?/?G?": 350,
      "RareTranscendant1/1G?": 4000,
      "RareTranscendant?/?G?": 2500,
      "LegendaryBasic?/?G0": 30000,
      "LegendaryBasic10/10G1": 200,
      "LegendaryBasic9/10G1": 170,
      "LegendaryBasic8/10G1": 150,
      "LegendaryBasic7/10G1": 130,
      "LegendaryBasic6/10G1": 100,
      "LegendaryBasic9/9G2": 180,
      "LegendaryBasic8/?G2": 150,
      "LegendaryBasic7/?G2": 135,
      "LegendaryBasic?/?G?": 100,
      "LegendaryAdvanced5/5G1": 350,
      "LegendaryAdvanced4/5G1": 300,
      "LegendaryAdvanced3/5G1": 280,
      "LegendaryAdvanced2/5G1": 250,
      "LegendaryAdvanced1/5G1": 200,
      "LegendaryAdvanced5/5G2": 330,
      "LegendaryAdvanced4/?G2": 280,
      "LegendaryAdvanced3/?G2": 260,
      "LegendaryAdvanced2/?G2": 230,
      "LegendaryAdvanced1/?G2": 190,
      "LegendaryAdvanced5/5G3": 310,
      "LegendaryAdvanced4/?G3": 260,
      "LegendaryAdvanced3/?G3": 240,
      "LegendaryAdvanced2/?G3": 210,
      "LegendaryAdvanced1/?G3": 170,
      "LegendaryAdvanced5/5G4": 280,
      "LegendaryAdvanced4/?G4": 240,
      "LegendaryAdvanced3/?G4": 200,
      "LegendaryAdvanced?/?G?": 150,
      "LegendaryElite3/3G?": 2000,
      "LegendaryElite2/?G?": 1800,
      "LegendaryElite1/?G?": 1500,
      "LegendaryElite?/?G?": 1100,
      "LegendaryTranscendant1/1G?": 5000,
      "LegendaryTranscendant?/?G?": 3500,
      "MythicBasic?/?G0": 35000,
      "MythicBasic10/10G1": 500,
      "MythicBasic9/10G1": 450,
      "MythicBasic8/10G1": 400,
      "MythicBasic7/10G1": 380,
      "MythicBasic6/10G1": 350,
      "MythicBasic9/9G2": 500,
      "MythicBasic8/?G2": 450,
      "MythicBasic7/?G2": 400,
      "MythicBasic?/?G?": 300,
      "MythicAdvanced5/5G1": 1000,
      "MythicAdvanced4/5G1": 900,
      "MythicAdvanced3/5G1": 800,
      "MythicAdvanced5/5G2": 950,
      "MythicAdvanced4/?G2": 850,
      "MythicAdvanced3/?G2": 750,
      "MythicAdvanced5/5G3": 900,
      "MythicAdvanced4/?G3": 800,
      "MythicAdvanced3/?G3": 700,
      "MythicAdvanced5/5G4": 800,
      "MythicAdvanced4/?G4": 700,
      "MythicAdvanced3/?G4": 600,
      "MythicAdvanced?/?G?": 500,
      "MythicElite3/3G?": 5000,
      "MythicElite2/?G?": 4500,
      "MythicElite1/?G?": 3500,
      "MythicElite?/?G?": 3000,
      "MythicTranscendant1/1G?": 20000,
      "MythicTranscendant?/?G?": 15000,
    },
    "subclassSetting": {
      /*
        你可以自訂你想要的職業與專業對的乘數
        格式為: "<職業名><副職業名>" 或是 "<職業名><副職業階級>"
        具體的設定會優先被取得
        沒有設定時就不會乘
      */
      "WarriorWarrior": 1.1,
      "WarriorKnight": 1.1,
      "WarriorPaladin": 1.3,
      "WarriorDarkKnight": 1.3,
      "WarriorAdvanced": 1.1,
      "WarriorDragoon": 2,
      "WarriorElite": 1.5,
      "WarriorDreadKnight": 5,
      "KnightWarrior": 1.1,
      "KnightKnight": 1.1,
      "KnightPaladin": 1.3,
      "KnightDarkKnight": 1.3,
      "KnightAdvanced": 1.1,
      "KnightDragoon": 2,
      "KnightElite": 1.5,
      "KnightDreadKnight": 5,
      "ArcherThief": 1.1,
      "ArcherArcher": 1.1,
      "ArcherPaladin": 1.3,
      "ArcherDarkKnight": 1.3,
      "ArcherAdvanced": 1.1,
      "ArcherDragoon": 2,
      "ArcherElite": 1.5,
      "ArcherDreadKnight": 5,
      "ThiefArcher": 1.1,
      "ThiefThief": 1.1,
      "ThiefPaladin": 1.3,
      "ThiefDarkKnight": 1.3,
      "ThiefAdvanced": 1.1,
      "ThiefDragoon": 2,
      "ThiefElite": 1.5,
      "ThiefDreadKnight": 5,
      "PriestPriest": 1.1,
      "PriestWizard": 1.1,
      "PriestAdvanced": 1.1,
      "PriestSummoner": 1.3,
      "PriestNinja": 1.2,
      "PriestElite": 1.5,
      "PriestSage": 2,
      "PriestDreadKnight": 5,
      "WizardWizard": 1.1,
      "WizardPriest": 1.1,
      "WizardAdvanced": 1.1,
      "WizardSummoner": 1.3,
      "WizardNinja": 1.2,
      "WizardElite": 1.5,
      "WizardSage": 2,
      "WizardDreadKnight": 5,
      "MonkMonk": 1.1,
      "MonkPirate": 1.1,
      "MonkAdvanced": 1.1,
      "MonkSummoner": 1.2,
      "MonkNinja": 1.3,
      "MonkElite": 1.5,
      "MonkSage": 2,
      "MonkDreadKnight": 5,
      "PiratePirate": 1.1,
      "PirateMonk": 1.1,
      "PirateAdvanced": 1.1,
      "PirateSummoner": 1.2,
      "PirateNinja": 1.3,
      "PirateElite": 1.5,
      "PirateSage": 2,
      "PirateDreadKnight": 5,
      "BerserkerBerserker": 1.1,
      "BerserkerSeer": 1.1,
      "BerserkerAdvanced": 1.1,
      "BerserkerShapeshifter": 1.2,
      "BerserkerBard": 1.2,
      "BerserkerElite": 1.5,
      "BerserkerSpellBow": 2,
      "BerserkerDreadKnight": 5,
      "BerserkerBerserker": 1.1,
      "SeerSeer": 1.1,
      "SeerBerserker": 1.05,
      "SeerAdvanced": 1.1,
      "SeerShapeshifter": 1.2,
      "SeerBard": 1.2,
      "SeerElite": 1.5,
      "SeerSpellBow": 2,
      "SeerDreadKnight": 5,
      "LegionnaireLegionnaire": 1.1,
      "LegionnaireScholar": 1.05,
      "LegionnaireAdvanced": 1.1,
      "LegionnaireShapeshifter": 1.2,
      "LegionnaireBard": 1.2,
      "LegionnaireElite": 1.5,
      "LegionnaireSpellBow": 2,
      "LegionnaireDreadKnight": 5,
      "ScholarScholar": 1.1,
      "ScholarLegionnaire": 1.05,
      "ScholarAdvanced": 1.1,
      "ScholarShapeshifter": 1.2,
      "ScholarBard": 1.2,
      "ScholarElite": 1.5,
      "ScholarSpellBow": 2,
      "ScholarDreadKnight": 5,
      "PaladinPaladin": 2,
      "PaladinDarkKnight": 1.8,
      "PaladinAdvanced": 1.3,
      "PaladinDragoon": 3,
      "PaladinElite": 2,
      "PaladinDreadKnight": 8,
      "DarkKnightDarkKnight": 2,
      "DarkKnightPaladin": 1.8,
      "DarkKnightAdvanced": 1.3,
      "DarkKnightDragoon": 3,
      "DarkKnightElite": 2,
      "DarkKnightDreadKnight": 8,
      "SummonerSummoner": 2,
      "SummonerNinja": 1.5,
      "SummonerAdvanced": 1.3,
      "SummonerSage": 3,
      "SummonerElite": 2,
      "SummonerDreadKnight": 8,
      "NinjaNinja": 2,
      "NinjaSummoner": 1.5,
      "NinjaAdvanced": 1.3,
      "NinjaSage": 3,
      "NinjaElite": 2,
      "NinjaDreadKnight": 8,
      "ShapeshifterShapeshifter": 2,
      "ShapeshifterBard": 1.5,
      "ShapeshifterAdvanced": 1.3,
      "ShapeshifterSpellBow": 3,
      "ShapeshifterElite": 2,
      "ShapeshifterDreadKnight": 8,
      "BardBard": 2,
      "BardShapeshifter": 1.5,
      "BardAdvanced": 1.3,
      "BardSpellBow": 3,
      "BardElite": 2,
      "BardDreadKnight": 8,
      "DragoonPaladin": 1.25,
      "DragoonDarkKnight": 1.25,
      "DragoonAdvanced": 1.1,
      "DragoonDragoon": 3,
      "DragoonElite": 2,
      "DragoonDreadKnight": 8,
      "SageSummoner": 1.25,
      "SageAdvanced": 1.1,
      "SageSage": 3,
      "SageElite": 2,
      "SageDreadKnight": 8,
      "SpellBowBasic": 0.7,
      "SpellBowSummoner": 0.9,
      "SpellBowAdvanced": 0.8,
      "SpellBowSpellBow": 1.5,
      "SpellBowElite": 1.2,
      "SpellBowDreadKnight": 2.5,
      "DreadKnightPaladin": 1.5,
      "DreadKnightDarkKnight": 1.5,
      "DreadKnightAdvanced": 1.3,
      "DreadKnightElite": 3,
      "DreadKnightDreadKnight": 10,
    },
    "professionSetting": {
      /*
        你可以自訂你想要的職業與專業對的乘數
        格式為: "<職業名><專業>"
        沒有設定時就不會乘
      */
      "WarriorMining": 1.3,
      "KnightMining": 1.3,
      "ArcherMining": 1.15,
      "ArcherForaging": 1.05,
      "ArcherGardening": 0.9,
      "ThiefFishing": 1.1,
      "ThiefMining": 1.15,
      "ThiefGardening": 0.9,
      "PriestForaging": 1.05,
      "WizardForaging": 1.05,
      "PirateFishing": 1.1,
      "PirateGardening": 0.9,
      "MonkFishing": 1.1,
      "MonkGardening": 0.9,
      "BerserkerMining": 1.15,
      "BerserkerGardening": 0.9,
      "LegionnaireMining": 1.15,
      "LegionnaireGardening": 0.9,
      "PaladinMining": 1.3,
      "DarkKnightMining": 1.3,
      "DarkKnightForaging": 1.05,
      "DarkKnightGardening": 0.9,
      "SummonerForaging": 1.05,
      "NinjaFishing": 1.2,
      "NinjaForaging": 1.05,
      "NinjaGardening": 0.9,
      "ShapeshifterFishing": 1.1,
      "ShapeshifterGardening": 0.9,
      "BardFishing": 1.2,
      "BardForaging": 1.1,
      "BardGardening": 0.9,
      "DragoonMining": 1.2,
      "DragoonGardening": 0.95,
      "SageForaging": 1.05,
      "SpellBowForaging": 1.05,
      "SpellBowGardening": 0.9,
      "DreadKnightMining": 1.1
    },
    "levelSetting": {
      /*
        你可以自訂你想要的職業階級與等級的乘數
        格式為: "<職業階級>LV<等級>"
        其中等級必須為 5 的倍數
        沒有設定時就不會乘
      */
      "BasicLV5": 1.1,
      "BasicLV10": 1.3,
      "BasicLV15": 1.8,
      "BasicLV20": 3,
      "AdvancedLV5": 1.1,
      "AdvancedLV10": 1.3,
      "AdvancedLV15": 1.8,
      "AdvancedLV20": 3,
      "EliteLV5": 1.1,
      "EliteLV10": 1.3,
      "EliteLV15": 1.8,
      "EliteLV20": 3,
      "TranscendantLV5": 1.1,
      "TranscendantLV10": 1.3,
      "TranscendantLV15": 1.8,
      "TranscendantLV20": 3,
    },
    "hairSetting": {
      /*
        你可以自訂你想要的職業階級與髮型造型的乘數
        格式為: "<職業階級><髮型階級>"
        沒有設定時就不會乘
      */
      "BasicAdvanced": 1.05,
      "BasicElite": 1.3,
      "BasicTranscendant": 2.5,
      "AdvancedAdvanced": 1.05,
      "AdvancedElite": 1.5,
      "AdvancedTranscendant": 3,
      "EliteAdvanced": 1.05,
      "EliteElite": 1.6,
      "EliteTranscendant": 3,
      "TranscendantAdvanced": 1.05,
      "TranscendantElite": 1.6,
      "TranscendantTranscendant": 3,
    },
    "backAppendageSetting": {
      /*
        你可以自訂你想要的職業階級與髮型造型的乘數
        格式為: "<職業階級><髮型階級>"
        沒有設定時就不會乘
      */
      "BasicAdvanced": 1.05,
      "BasicElite": 1.3,
      "BasicTranscendant": 2.5,
      "AdvancedAdvanced": 1.05,
      "AdvancedElite": 1.5,
      "AdvancedTranscendant": 3,
      "EliteAdvanced": 1.05,
      "EliteElite": 1.6,
      "EliteTranscendant": 3,
      "TranscendantAdvanced": 1.05,
      "TranscendantElite": 1.6,
      "TranscendantTranscendant": 3,
    },
    "skillSetting": {
      /*
        你可以自訂你想要的職業階級與技能的乘數
        格式為: "<職業階級>Total<技能分數>" 或是 <主職業><active1>/<active2>/<passive1>/<passive2>
        技能分數計算方式: Advanced 的技能是 1 分，Elite 是 2 分，Transcendant 是 3 分
        範例: BaiscTotal3, AdvancedTotal4 或是 WarriorB5/B6/B8/A1, WizardA3/A1/B5/B7
        沒有設定時就不會乘
      */
      "BasicTotal1": 1.01,
      "BasicTotal2": 1.5,
      "BasicTotal3": 2,
      "BasicTotal4": 3,
      "BasicTotal5": 4,
      "BasicTotal6": 4,
      "BasicTotal7": 4,
      "BasicTotal8": 4,
      "AdvancedTotal1": 1.02,
      "AdvancedTotal2": 1.5,
      "AdvancedTotal3": 2,
      "AdvancedTotal4": 2.5,
      "AdvancedTotal5": 3,
      "AdvancedTotal6": 3,
      "AdvancedTotal7": 3,
      "AdvancedTotal8": 3,
      "EliteTotal1": 1.02,
      "EliteTotal2": 1.2,
      "EliteTotal3": 1.6,
      "EliteTotal4": 2,
      "EliteTotal5": 2.5,
      "EliteTotal6": 2.5,
      "EliteTotal7": 2.5,
      "EliteTotal8": 2.5,
      "TranscendantTotal1": 1.02,
      "TranscendantTotal2": 1.2,
      "TranscendantTotal3": 1.6,
      "TranscendantTotal4": 2,
      "TranscendantTotal5": 2.5,
      "TranscendantTotal6": 2.5,
      "TranscendantTotal7": 2.5,
      "TranscendantTotal8": 2.5,
    }
  },
  "autoRenterSetting": {
    "rentalEstimateAdjustment": 2, // 出租估價完會在乘以這個數，如果覺得估價太低或太高可以調整這個數字
    "KLAYNetworkRentalEstimateAdjustment": 1.3, // KLAY 鏈的出租估價完會在乘以這個數，如果覺得 KLAY 鏈估價太低或太高可以調整這個數字
    "DFKNetworkRentalEstimateAdjustment": 1, // DFK 鏈的出租估價完會在乘以這個數，如果覺得 DFK 鏈估價太低或太高可以調整這個數字
    "rentFloorPrice": 10, // 被評估為沒有任何出租價值的英雄會被用這個價格乘以上方的調整後出租
    "rentFloorSwitch": true, // 設定是否要將沒有出租價值的英雄照地板價出租的開關，只有設為 true 才會自動出租 
  },
  "notForRentHeroIds": [
    // 把你不想出租的英雄 ID 寫在這裡，例如： "1565", "1234" 
  ],
  "autoLevelUpLimit": 10, // 表示至幾 LV 後不再自動升級。
  "notForLevelUpHeroIds": [
    // 把你不想自動升級的英雄 ID 寫在這裡，例如： "1716", "123456"
  ],
  "sendHeroTo": null, // 可以填入一個地址，當完成任務時會把所有完成任務的英雄傳入這個地址，當你要換錢包的時候可以使用這個功能
  "setQuestScriptTimeSecond": 420, // 設定你每次任務腳本執行的間隔秒數
  "setDuelScriptTimeSecond": 5, // 設定你每次執行 duel 腳本的間隔秒數
}

module.exports = config;
